---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ConnectionTypeChangedService
source: html/a62d6e7b-9d2a-8eb1-fa57-0e00a7157437.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ConnectionTypeChangedService Property

The external service used to notify when structural connection changed the type.

## Syntax (C#)
```csharp
public static ExternalServiceId ConnectionTypeChangedService { get; }
```